# Scikit-Transformers : BaseDataCleaner

## Imports

Import warnings and disable warnings for this notebook.

In [1]:
import warnings

warnings.filterwarnings("ignore")

Import the data libraries

In [2]:
import pandas as pd
import numpy as np

Import visualisation libraries

In [3]:
import seaborn as sns

Uncomment the following cell to install the necessary packages.

In [4]:
#!pip install scikit-transformers

Import scikit-transformers

In [5]:
try:
    from sktransf.utils import get_titanics
except Exception as e:
    print(e)
    print("Please install thea package using the following command")
    print("pip install scikit-transformers")
    from sktransf.utils import get_titanic

cannot import name 'get_titanics' from 'sktransf.utils' (/home/alex/tmp/scikit-transformers/sktransf/utils/__init__.py)
Please install thea package using the following command
pip install scikit-transformers

In [6]:
from sktransf.cleaner import BaseDataCleaner

## Data

Get the data from the [Kaggle](https://www.kaggle.com/c/titanic/data) Titanic dataset.

In [14]:
df, _ = get_titanic(only_num=False)

Display the first few rows of the data.

In [15]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Display the new df

In [16]:
df.sample(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
590,591,3,"Rintamaki, Mr. Matti",male,35.0,0,0,STON/O 2. 3101273,7.1250,NaN,S
685,686,2,"Laroche, Mr. Joseph Philippe Lemercier",male,25.0,1,2,SC/Paris 2123,41.5792,NaN,C
22,23,3,"McGowan, Miss. Anna ""Annie""",female,15.0,0,0,330923,8.0292,NaN,Q
413,414,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0000,NaN,S
357,358,2,"Funk, Miss. Annie Clemmer",female,38.0,0,0,237671,13.0000,NaN,S
425,426,3,"Wiseman, Mr. Phillippe",male,NaN,0,0,A/4. 34244,7.2500,NaN,S
402,403,3,"Jussila, Miss. Mari Aina",female,21.0,1,0,4137,9.8250,NaN,S
441,442,3,"Hampe, Mr. Leon",male,20.0,0,0,345769,9.5000,NaN,S
389,390,2,"Lehmann, Miss. Bertha",female,17.0,0,0,SC 1748,12.0000,NaN,C
844,845,3,"Culumovic, Mr. Jeso",male,17.0,0,0,315090,8.6625,NaN,S

Adding dummy features

In [17]:
df["bool_column"] = np.random.choice(["A", "B"], size=df.shape[0])
df["unique_column"] = "dummy"
df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,bool_column,unique_column
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,B,dummy
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,B,dummy
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,B,dummy
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,A,dummy
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,A,dummy
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,B,dummy
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,B,dummy
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,B,dummy
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,B,dummy
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,A,dummy

## Using BaseDataCleaner

In [18]:
cleaner = BaseDataCleaner(force_df_out=True)
clean_df = cleaner.fit_transform(df)
clean_df

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,bool_column
0,1.386294,1,22.0,1,0.000000,A/5 21171,2.110213,NaN,S,0
1,0.693147,0,38.0,1,0.000000,PC 17599,4.280593,C85,C,0
2,1.386294,0,26.0,0,0.000000,STON/O2. 3101282,2.188856,NaN,S,0
3,0.693147,0,35.0,1,0.000000,113803,3.990834,C123,S,1
4,1.386294,1,35.0,0,0.000000,373450,2.202765,NaN,S,1
...,...,...,...,...,...,...,...,...,...,...
886,1.098612,1,27.0,0,0.000000,211536,2.639057,NaN,S,0
887,0.693147,0,19.0,0,0.000000,112053,3.433987,B42,S,0
888,1.386294,0,NaN,1,1.098612,W./C. 6607,3.196630,NaN,S,0
889,0.693147,1,26.0,0,0.000000,111369,3.433987,C148,C,0
890,1.386294,1,32.0,0,0.000000,370376,2.169054,NaN,Q,1

In [21]:
cleaner = BaseDataCleaner(
    force_df_out=True, sku_threshold=0.5, skew_threshold=3
)
clean_df = cleaner.fit_transform(df)
clean_df

     Pclass Sex   Age  SibSp  Parch     Fare Embarked bool_column
0         3   1  22.0      1      0   7.2500        S           0
1         1   0  38.0      1      0  71.2833        C           0
2         3   0  26.0      0      0   7.9250        S           0
3         1   0  35.0      1      0  53.1000        S           1
4         3   1  35.0      0      0   8.0500        S           1
..      ...  ..   ...    ...    ...      ...      ...         ...
886       2   1  27.0      0      0  13.0000        S           0
887       1   0  19.0      0      0  30.0000        S           0
888       3   0   NaN      1      2  23.4500        S           0
889       1   1  26.0      0      0  30.0000        C           0
890       3   1  32.0      0      0   7.7500        Q           1

[891 rows x 8 columns]

Fit and transform the data using the StandardScaler

In [13]:
clean_df = StandardScaler(force_df_out=True).fit_transform(df)
clean_df

NameError: name 'StandardScaler' is not defined

Checking the new Fare column

In [ ]:
clean_df.Fare.describe().round(0)

In [ ]:
sns.displot(clean_df.Fare)